# Area Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..Area Property
Face Class See Also
---
The area of this face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Area { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Area As Double
	Get
```

Visual C++
---
```text
public:
property double Area {
	double get ();
}
```

# Remarks
Returns zero if fails to compute the area. In some cases, this area may be estimated.
# See Also
Face Class
Autodesk.Revit.DB Namespace